// email邮箱(6~18个字符,可使用字母、数字、下划线,需要字母开头)
const email = /^[\w]+\@([A-Za-z0-9_\-\.])+\.([A-Za-z]{2,4})$/;

// qq号码(5~11位数字)
const qq = /^[1-9][0-9{4,10}$]/;

// 微信号(必须以字母开头,可使用6-20个字母、数字、下划线和减号,不可设置中文)
const wechat = /^[a-zA-Z]{1}[-\w]{5,19}$/;

// url
const url = /(((^https?:(?:\/\/)?)(?:[-;:&=\+\$,\w]+@)?[A-Za-z0-9.-]+|(?:www.|[-;:&=\+\$,\w]+@)[A-Za-z0-9.-]+)((?:\/[\+~%\/.\w-_]*)?\??(?:[-\+=&;%@.\w_]*)#?(?:[\w]*))?)$/g;

// ipv4地址
const ipv4 = /^(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$/;

// reg hex16进制颜色
const hex16 = /^#?([a-fA-F0-9]{6}|[a-fA-F0-9]{3})$/;

// window系统文件名称
const windowFileName = /[\\\/:*?\"<>|]/;
